'use client';

import {TicketCard} from "@app/ui/TicketCard/TicketCard";
import {rows} from "@app/ui/utils";
import {ReviewCard} from "@app/ui/ReviewCard/ReviewCard";
import {MovieCard} from "@app/ui/MovieCard/MovieCard";

export default function Components() {
    return (
        <div className={rows}>
            <MovieCard
                imageUrl="/poster.png"
                title="Властелин колец: Братство кольца"
                genre="Фэнтези"
                releaseYear={2001}
                rating={8}
                director="Питер Джексон"
                description="Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу. Тихая деревня, где живут хоббиты. Придя на 111-й день рождения к своему старому другу Бильбо Бэггинсу, волшебник Гэндальф начинает вести разговор о кольце, которое Бильбо нашел много лет назад. Это кольцо принадлежало когда-то темному властителю Средиземья Саурону, и оно дает большую власть своему обладателю. Теперь Саурон хочет вернуть себе власть над Средиземьем. Бильбо отдает Кольцо племяннику Фродо, чтобы тот отнёс его к Роковой Горе и уничтожил."
                count={5}
                onAddClick={() => {
                }}
                onSubtractClick={() => {
                }}
            />
            <TicketCard
                imageUrl="/poster.png"
                title="Властелин колец: Братство кольца"
                genre="Фэнтези"
                count={5}
                onAddClick={() => {
                }}
                onSubtractClick={() => {
                }}
            />
            <ReviewCard
                name="Роман"
                description="По счастью мне довелось посмотреть фильм раньше, чем прочесть книгу. Это было около четырех лет назад, но тот момент я вспоминаю и по сей день. До него я не был фанатом Джона Толкина, как впрочем, и всего фентези в целом, однако стоило мне посмотреть первые десять минут фильма и оставшиеся пролетели на одном дыхании. Я словно погрузился в необычайный мир, где добро борется со злом, где зеленые рощи перемежаются с поросшими мхом статуями и древними развалинами, в мир, где пробираясь лесною тропой можно встретить остроухих неувядающих эльфов или мерзких орков – кому как повезет..."
                rating={8}
            />
        </div>
    )
}
